## Assignment on Measures of Central Tendency and Dispersion

In [12]:
import numpy as np

import pandas as pd

In [13]:
df = pd.read_csv(r'C:\Users\Arathi\Downloads\StudentsPerformance.csv')

In [14]:
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33
...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100

### 1. Find out how many males and females participated in the test.

In [15]:
df['gender'].value_counts()

female    518
male      482
Name: gender, dtype: int64

### 2. What do you think about the students parental level of education?

In [16]:
df['parental level of education'].unique()

array(['some high school', 'high school', 'some college',
       "associate's degree", "bachelor's degree", "master's degree"],
      dtype=object)

### 3. Who scores the most on average for math, reading and writing based on
#### ● Gender
#### ● Test preparation course

In [17]:
df.groupby(by='gender').mean()

        math score  reading score  writing score
gender
female   63.376448      72.590734      72.467181
male     68.821577      65.545643      63.446058

In [18]:
df.groupby(by='test preparation course').mean()

                         math score  reading score  writing score
test preparation course
completed                  69.96648      74.175978      74.684358
none                       63.78972      66.417445      64.457944

### 4. What do you think about the scoring variation for math, reading and writing based on

#### ● Gender
#### ● Test preparation course

In [19]:
df.groupby(by='gender').var()

        math score  reading score  writing score
gender
female  256.958593     207.677438     220.369327
male    211.889097     200.211010     202.413924

In [20]:
df.groupby(by='test preparation course').var()

                         math score  reading score  writing score
test preparation course
completed                210.884027     183.265864     175.202612
none                     246.668662     213.419851     226.251739

### 5. The management needs your help to give bonus points to the top 25% of students based on their math score, so how will you help the management to achieve this.

In [21]:
df['math score'].quantile(0.75)

77.0